<?php
/**
 * Copyright © 2020 EUSTYLE LABORATORY - ALL RIGHTS RESERVED.
 * UNAUTHORIZED COPYING OF THIS FILE, VIA ANY MEDIUM IS STRICTLY PROHIBITED PROPRIETARY AND CONFIDENTIAL.
 */
declare(strict_types=1);

namespace Tests\Unit\Faker;

use Domain\Common\Sex;
use Domain\Common\StructuredName;
use Faker\Provider\Base;
use Illuminate\Support\Arr;

/**
 * Fake Name Provider
 */
final class FakeNameProvider extends Base
{
    private const FAMILY_NAMES = [
        ['相馬', 'アイバ'],
        ['赤坂', 'アカサカ'],
        ['浅見', 'アサミ'],
        ['浅利', 'アサリ'],
        ['新井', 'アライ'],
        ['安藤', 'アンドウ'],
        ['伊沢', 'イザワ'],
        ['石田', 'イシダ'],
        ['和泉', 'イズミ'],
        ['板倉', 'イタクラ'],
        ['市川', 'イチカワ'],
        ['稲田', 'イナダ'],
        ['乾', 'イヌイ'],
        ['井本', 'イモト'],
        ['岩淵', 'イワブチ'],
        ['岩村', 'イワムラ'],
        ['上野', 'ウエノ'],
        ['宇佐美', 'ウサミ'],
        ['梅津', 'ウメヅ'],
        ['江口', 'エグチ'],
        ['大久保', 'オオクボ'],
        ['岡田', 'オカダ'],
        ['奥村', 'オクムラ'],
        ['小野田', 'オノダ'],
        ['香川', 'カガワ'],
        ['片桐', 'カタギリ'],
        ['川西', 'カワニシ'],
        ['河原', 'カワハラ'],
        ['菊地', 'キクチ'],
        ['木田', 'キダ'],
        ['北沢', 'キタザワ'],
        ['木村', 'キムラ'],
        ['木本', 'キモト'],
        ['熊井', 'クマイ'],
        ['倉田', 'クラタ'],
        ['小池', 'コイケ'],
        ['河本', 'コウモト'],
        ['児島', 'コジマ'],
        ['小峰', 'コミネ'],
        ['小柳', 'コヤナギ'],
        ['斎藤', 'サイトウ'],
        ['榊原', 'サカキバラ'],
        ['坂下', 'サカシタ'],
        ['佐川', 'サガワ'],
        ['佐々木', 'ササキ'],
        ['佐竹', 'サタケ'],
        ['椎名', 'シイナ'],
        ['塩田', 'シオタ'],
        ['重田', 'シゲタ'],
        ['柴田', 'シバタ'],
        ['菅原', 'スガワラ'],
        ['杉浦', 'スギウラ'],
        ['杉本', 'スギモト'],
        ['妹尾', 'セオ'],
        ['曽我', 'ソガ'],
        ['園田', 'ソノダ'],
        ['高城', 'タカギ'],
        ['滝川', 'タキガワ'],
        ['竹本', 'タケモト'],
        ['田中', 'タナカ'],
        ['田辺', 'タナベ'],
        ['玉井', 'タマイ'],
        ['丹羽', 'タンバ'],
        ['津田', 'ツダ'],
        ['土橋', 'ツチハシ'],
        ['坪井', 'ツボイ'],
        ['鶴田', 'ツルタ'],
        ['富樫', 'トガシ'],
        ['徳田', 'トクタ'],
        ['戸塚', 'トヅカ'],
        ['長沢', 'ナガサワ'],
        ['中村', 'ナカムラ'],
        ['永山', 'ナガヤマ'],
        ['成瀬', 'ナルセ'],
        ['西野', 'ニシノ'],
        ['野村', 'ノムラ'],
        ['畠山', 'ハタヤマ'],
        ['早川', 'ハヤカワ'],
        ['平田', 'ヒラタ'],
        ['福田', 'フクダ'],
        ['古谷', 'フルタニ'],
        ['堀', 'ホリ'],
        ['前原', 'マエハラ'],
        ['町田', 'マチダ'],
        ['松本', 'マツモト'],
        ['丸田', 'マルタ'],
        ['三谷', 'ミタニ'],
        ['宮部', 'ミヤベ'],
        ['目黒', 'メグロ'],
        ['茂木', 'モギ'],
        ['百田', 'モモタ'],
        ['森川', 'モリカワ'],
        ['八木', 'ヤギ'],
        ['柳原', 'ヤナギハラ'],
        ['矢部', 'ヤベ'],
        ['山西', 'ヤマニシ'],
        ['横尾', 'ヨコオ'],
        ['吉野', 'ヨシノ'],
        ['米倉', 'ヨネクラ'],
        ['脇田', 'ワキタ'],
    ];

    private const GIVEN_NAMES_FOR_FEMALE = [
        ['亜希', 'アキ'],
        ['あさみ', 'アサミ'],
        ['淳子', 'アツコ'],
        ['綾', 'アヤ'],
        ['彩夏', 'アヤカ'],
        ['有紗', 'アリサ'],
        ['杏', 'アン'],
        ['郁恵', 'イクエ'],
        ['麗美', 'ウルミ'],
        ['恵梨香', 'エリカ'],
        ['薫', 'カオル'],
        ['一恵', 'カヅエ'],
        ['夏菜子', 'カナコ'],
        ['京子', 'キョウコ'],
        ['恵子', 'ケイコ'],
        ['早紀', 'サキ'],
        ['貞子', 'サダコ'],
        ['沙知絵', 'サチエ'],
        ['聡美', 'サトミ'],
        ['沙耶', 'サヤ'],
        ['詩織', 'シオリ'],
        ['樹里', 'ジュリ'],
        ['順子', 'ジュンコ'],
        ['環樹', 'タマキ'],
        ['千佳', 'チカ'],
        ['千夏', 'チナツ'],
        ['敏江', 'トシエ'],
        ['友香', 'トモカ'],
        ['直美', 'ナオミ'],
        ['夏希', 'ナツキ'],
        ['奈々', 'ナナ'],
        ['希美', 'ノゾミ'],
        ['倫子', 'ノリコ'],
        ['花子', 'ハナコ'],
        ['春香', 'ハルカ'],
        ['瞳', 'ヒトミ'],
        ['真奈美', 'マナミ'],
        ['麻由子', 'マユコ'],
        ['美佳', 'ミカ'],
        ['実紀', 'ミキ'],
        ['路子', 'ミチコ'],
        ['美帆', 'ミホ'],
        ['美幸', 'ミユキ'],
        ['恵美', 'メグミ'],
        ['桃子', 'モモコ'],
        ['優', 'ユウ'],
        ['由樹', 'ユキ'],
        ['陽子', 'ヨウコ'],
        ['涼子', 'リョウコ'],
        ['れに', 'レニ'],
    ];

    private const GIVEN_NAMES_FOR_MALE = [
        ['明宏', 'アキヒロ'],
        ['アキラ', 'アキラ'],
        ['惇', 'アツシ'],
        ['新太', 'アラタ'],
        ['育二', 'イクジ'],
        ['栄一', 'エイイチ'],
        ['一也', 'カズヤ'],
        ['和之', 'カズユキ'],
        ['克実', 'カツミ'],
        ['慶太', 'ケイタ'],
        ['賢治', 'ケンジ'],
        ['晃司', 'コウジ'],
        ['幸平', 'コウヘイ'],
        ['聡', 'サトシ'],
        ['俊二', 'シュンジ'],
        ['翔太', 'ショウタ'],
        ['仁', 'ジン'],
        ['真一', 'シンイチ'],
        ['真吾', 'シンゴ'],
        ['昴', 'スバル'],
        ['精児', 'セイジ'],
        ['染五郎', 'ソメゴロウ'],
        ['大五郎', 'ダイゴロウ'],
        ['丈雄', 'タケオ'],
        ['竜也', 'タツヤ'],
        ['太郎', 'タロウ'],
        ['照生', 'テルオ'],
        ['徹', 'トオル'],
        ['寿明', 'トシアキ'],
        ['利夫', 'トシオ'],
        ['敏也', 'トシヤ'],
        ['知史', 'トモフミ'],
        ['英嗣', 'ヒデツグ'],
        ['人志', 'ヒトシ'],
        ['仁晶', 'ヒロアキ'],
        ['寛', 'ヒロシ'],
        ['宏', 'ヒロシ'],
        ['宏行', 'ヒロユキ'],
        ['雅彦', 'マサヒコ'],
        ['将也', 'マサヤ'],
        ['雅之', 'マサユキ'],
        ['守', 'マモル'],
        ['光臣', 'ミツオミ'],
        ['光洋', 'ミツヒロ'],
        ['未來', 'ミライ'],
        ['扶樹', 'モトキ'],
        ['勇一', 'ユウイチ'],
        ['祐一', 'ユウイチ'],
        ['勇太', 'ユウタ'],
        ['亮', 'リョウ'],
    ];

    /**
     * 名前を生成する.
     *
     * @param \Domain\Common\Sex $sex
     * @return \Domain\Common\StructuredName
     */
    public function name(Sex $sex): StructuredName
    {
        [$familyName, $phoneticFamilyName] = $this->familyName();
        [$givenName, $phoneticGivenName] = $this->givenName($sex);
        return new StructuredName(
            familyName: $familyName,
            givenName: $givenName,
            phoneticFamilyName: $phoneticFamilyName,
            phoneticGivenName: $phoneticGivenName,
        );
    }

    /**
     * @return string[]
     */
    private function familyName(): array
    {
        return Arr::random(self::FAMILY_NAMES);
    }

    /**
     * @param \Domain\Common\Sex $sex
     * @return array
     */
    private function givenName($sex): array
    {
        return Arr::random($sex === Sex::female() ? self::GIVEN_NAMES_FOR_FEMALE : self::GIVEN_NAMES_FOR_MALE);
    }
}
